zacharyrodwatkins/CrossIDE/Call51/Include/mcs51/EFM8UB2.h
// ADC multiplexer selection values for 32-pin packages (both QFN and QFP)
#define LQFP32_MUX_P1_0   0b_000000  
#define LQFP32_MUX_P1_1   0b_000001 
#define LQFP32_MUX_P1_2   0b_000010
#define LQFP32_MUX_P1_3   0b_000011
#define LQFP32_MUX_P1_4   0b_000100
#define LQFP32_MUX_P1_5   0b_000101
#define LQFP32_MUX_P1_6   0b_000110
#define LQFP32_MUX_P1_7   0b_000111
#define LQFP32_MUX_P2_0   0b_001000
#define LQFP32_MUX_P2_1   0b_001001
#define LQFP32_MUX_P2_2   0b_001010
#define LQFP32_MUX_P2_3   0b_001011
#define LQFP32_MUX_P2_4   0b_001100
#define LQFP32_MUX_P2_5   0b_001101
#define LQFP32_MUX_P2_6   0b_001110
#define LQFP32_MUX_P2_7   0b_001111
#define LQFP32_MUX_P3_0   0b_010000
#define LQFP32_MUX_P0_0   0b_010001
#define LQFP32_MUX_P0_1   0b_010010
#define LQFP32_MUX_P0_4   0b_010011
#define LQFP32_MUX_P0_5   0b_010100
#define LQFP32_MUX_TEMP   0b_011110
#define LQFP32_MUX_VREF   0b_011110 
#define LQFP32_MUX_VDD    0b_011111
#define LQFP32_MUX_GND    0b_011111

// ADC multiplexer selection values for 48-pin packages
#define TQFP48_MUX_P2_0   0b_000000  
#define TQFP48_MUX_P2_1   0b_000001  
#define TQFP48_MUX_P2_2   0b_000010  
#define TQFP48_MUX_P2_3   0b_000011  
#define TQFP48_MUX_P2_5   0b_000100  
#define TQFP48_MUX_P2_6   0b_000101  
#define TQFP48_MUX_P3_0   0b_000110  
#define TQFP48_MUX_P3_1   0b_000111  
#define TQFP48_MUX_P3_4   0b_001000  
#define TQFP48_MUX_P3_5   0b_001001  
#define TQFP48_MUX_P3_7   0b_001010  
#define TQFP48_MUX_P4_0   0b_001011  
#define TQFP48_MUX_P4_3   0b_001100  
#define TQFP48_MUX_P4_4   0b_001101  
#define TQFP48_MUX_P4_5   0b_001110  
#define TQFP48_MUX_P4_6   0b_001111  
#define TQFP48_MUX_P0_3   0b_010001  
#define TQFP48_MUX_P0_4   0b_010010  
#define TQFP48_MUX_P1_1   0b_010011  
#define TQFP48_MUX_P1_2   0b_010100  
#define TQFP48_MUX_P1_0   0b_010101  
#define TQFP48_MUX_P1_3   0b_010110  
#define TQFP48_MUX_P1_6   0b_010111  
#define TQFP48_MUX_P1_7   0b_011000  
#define TQFP48_MUX_P2_4   0b_011001  
#define TQFP48_MUX_P2_7   0b_011010  
#define TQFP48_MUX_P3_2   0b_011011  
#define TQFP48_MUX_P3_3   0b_011100  
#define TQFP48_MUX_P3_6   0b_011101  
#define TQFP48_MUX_TEMP   0b_011110  
#define TQFP48_MUX_VREF   0b_011110  
#define TQFP48_MUX_VDD    0b_011111  
#define TQFP48_MUX_GND    0b_011111  
#define TQFP48_MUX_P4_1   0b_100000  
#define TQFP48_MUX_P4_2   0b_100001  
#define TQFP48_MUX_P4_7   0b_100010  


#endif // #define EFM8UB2_H
